In [3]:
import pandas as pd
data = {
    'foo': ['one']*3 + ['two']*3,
    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    'baz': [1, 2, 3, 4, 5, 6],
    'zoo': ['x', 'y', 'z', 'q', 'w', 't']
}
df = pd.DataFrame(data)
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [2]:
pivot_df = pd.pivot(df, index='foo', columns='bar', values='baz')
pivot_df

bar  A  B  C
foo
one  1  2  3
two  4  5  6